<template>  
<div class="instructions">
<h1>使用说明（v1.0）</h1>
<el-divider />
<p>TIM交通数据管理平台简称“TDP”，面向泛交通行业提供了多类常用的数据处理和管理工具，目前包括以下功能模块：</p>
<p>1、交通流数据处理工具箱</p>
<p>2、公路桩号坐标计算工具箱</p>
<p>3、交通流数据质量可视化工具</p>
<el-divider />
<h2>交通流数据处理工具箱</h2>
<p class="text">交通流数据处理工具箱主要为三维数字孪生场景中交通流效果提供数据预处理能力，保障三维数字孪生场景中的交通流运行平滑和稳定，该工具箱可将动静态的交通流数据进行数据整合和传输频率规整、跨传感器轨迹整合、数据落盘存储、轨迹纠偏以及根据场景镜头位置进行轨迹调度。</p>
<h3>数据整合和传输频率规整</h3>
<p class="text">跨传感器轨迹融合功能主要应用于安装了雷视融合感知设备的道路场景。在此种场景下，多路感知设备会分别上传感知数据，这些数据的上传周期是固定的，但上传时间点各有差异，这会造成数据时钟不同步导致车流效果闪烁。使用该功能可对多路数据进行强制的时钟同步,将单一周期内多个数据源发送的数据或单一数据源发送的多个数据帧整合到一个数据帧当中，同时删除其中的重复数据。</p>
<div id="p1">
    <img src="../assets/p1.png" style="width:100%; height:100%" alt="p1">
</div>
<h4>设置方法</h4>
<p>step1.设置任务名称</p>
<p>step2.设置输出地址</p>
<p>step3.在数据源一栏中，选择在线数据，写入数据源地址，需要为websocket协议，数据格式见TIMAPI文档</p>
<p>step4 .在数据源一栏中，选择在线数据，写入数据源地址，需要为websocket协议，数据格式见TIMAPI文档</p>
<h3>跨传感器轨迹融合</h3>
<p class="text">在多路雷视融合感知设备的道路场景中，常常出现感知设备的感知区域重叠的情况，这会导致同一个目标会以不同的id出现两次，此功能开启后，我们会通过高性能的实时位置计算，将相对距离小于一定范围的目标识别为相同目标，将冗余数据删除。</p>
<h3>轨迹数据落盘存储</h3>
<p class="text">支持将轨迹数据实时存入Mysql数据库，可对存储时间进行管理，超出存储时间后，自动对数据进行删除。数据库需要用户自行配置</p>
<h3>轨迹纠偏</h3>
<p class="text">支持依据高精路网或车道中心线矢量数据（可由公路桩号坐标计算工具输出）对车辆轨迹进行纠偏，保证车辆始终运行在车道中心线上，不会出现由于数据质量造成的左右闪动，同时会保证车辆变道的平滑效果</p>
<h3>轨迹调度</h3>
<p class="text">当场景中的车辆超过2000辆时，由于硬件设备性能瓶颈限制，三维数字孪生场景可能出现卡顿，此功能开启后，会根据镜头位置对镜头外的数据进行动态剔除，减轻硬件压力，提高场景流畅性</p>
</div>
</template>  
  
<script>  

</script>  
  
<style>  
.instructions{
   position: absolute;
   width: 850px;
   left: 300px;
   top: 20px;
   height: 100%;
   border-radius: 30px 0px 0px 30px;
   opacity: 1;
   color: white;
   background: #1C1E24;
}
.text{
    line-height: 30px;
}

#p1{
   width: 1230px;
   left: 500px;
}
</style>